{"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_35", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 68], "dtype": "float32", "sparse": false, "name": "input_35"}, "inbound_nodes": []}, {"name": "input_36", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_36"}, "inbound_nodes": []}, {"name": "sequential_68", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_50", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 22, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Dropout", "config": {"name": "dropout_63", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}}], "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"name": "sequential_70", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_52", "trainable": true, "batch_input_shape": [null, 4], "dtype": "float32", "input_dim": 22, "output_dim": 64, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 4}}, {"class_name": "Dropout", "config": {"name": "dropout_65", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}}], "inbound_nodes": [[["input_36", 0, 0, {}]]]}, {"name": "dot_17", "class_name": "Dot", "config": {"name": "dot_17", "trainable": true, "axes": [2, 2], "normalize": false}, "inbound_nodes": [[["sequential_68", 1, 0, {}], ["sequential_70", 1, 0, {}]]]}, {"name": "activation_31", "class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_17", 0, 0, {}]]]}, {"name": "sequential_69", "class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_51", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 22, "output_dim": 4, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Dropout", "config": {"name": "dropout_64", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}}], "inbound_nodes": [[["input_35", 0, 0, {}]]]}, {"name": "add_15", "class_name": "Add", "config": {"name": "add_15", "trainable": true}, "inbound_nodes": [[["activation_31", 0, 0, {}], ["sequential_69", 1, 0, {}]]]}, {"name": "permute_15", "class_name": "Permute", "config": {"name": "permute_15", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"name": "concatenate_15", "class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "axis": -1}, "inbound_nodes": [[["permute_15", 0, 0, {}], ["sequential_70", 1, 0, {}]]]}, {"name": "lstm_15", "class_name": "LSTM", "config": {"name": "lstm_15", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 32, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "dropout_66", "class_name": "Dropout", "config": {"name": "dropout_66", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["lstm_15", 0, 0, {}]]]}, {"name": "dense_15", "class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "units": 22, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_66", 0, 0, {}]]]}, {"name": "activation_32", "class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_15", 0, 0, {}]]]}], "input_layers": [["input_35", 0, 0], ["input_36", 0, 0]], "output_layers": [["activation_32", 0, 0]]}, "keras_version": "2.1.5", "backend": "tensorflow"}